{"title":"La carrera de Cristiano Ronaldo","markdown":{"yaml":{"title":"La carrera de Cristiano Ronaldo","description":"En este trabajo analizaremos la carrera de Cristiano Ronaldo, para algunos, el mejor de la historia, en base a datos y estadisiticas conseguidas a lo largo de su carrera.\n","author":[{"name":"José Mª Pérez Marco (jomape4@alumni.uv.es)"}],"date":"2023-05-30","categories":["trabajo Big Data"],"image":"./imagenes/profile.jpg","title-block-banner":true,"title-block-banner-color":"white","toc":true,"toc-location":"left","toc-depth":3,"smooth-scroll":true,"format":{"html":{"mainfont":"serif","link-external-newwindow":true}},"code-tools":true,"code-link":true},"headingText":"Introducción","containsRefs":false,"markdown":"\n\n\nCristiano Ronaldo es, para algunos, el mejor jugador de la historia. Sin embargo, algo que podemos asegurar en base a datos es que se sí se trata del máximo goleador de la historia del fútbol ya que con un total de 710 goles (y aumentando) se coloca en primer lugar de esta clasificación llevandolo así a conseguir 5 balones de oro, 5 Champions League y 2 botas de oro, entre otros muchos.\n\nEn primer lugar, explicaremos la estructura del trabajo y el orden del analisis estadísitico que realizaremos del jugador.\n\nLo primero a destacar será analizar los goles en cada club que el jugador ha estado observando las grandes diferencias entre estos.\n\nEn segundo lugar, realizaremos una gráfico en la que se podrá observar el número de goles de Cristiano en cada competición. Además, para produndizar en el tema, también haremos una tabla que muestre el club con el que anotó los tantos en cada competición.\n\nEn tercer lugar, explicaremos los goles anotados por el futbolista en cada temporada de su carrera, empezando en la temporada 2002/2003 hasta la actualidad.\n\nEn cuarto lugar, mencionaremos y analizaremos si los tantos anotados por el futbolista fueron jugando como local o como visitante observando así si hay diferencias entre jugar junto a su afición o no en cada club en el que ha estado.\n\nEn penúltimo lugar, distinguiremos la forma de marcar los goles puesto que no todo son de la misma manera ni con la misma parte del cuerpo.\n\nPor último, y centrándonos en la liga española en su etapa por el Real Madrid, observaremos sus principales \"víctimas\" a las cuáles les ha marcado un mayor número de goles.\n\n# Datos del trabajo\n\nLa base de datos utilizada en el trabajo ha sido obtenida en su 100% de la página web de base de datos Kaggle. \n\n# Código R utilizado\n\n```{r}\nlibrary(readr)\nlibrary(gapminder)\nlibrary(gganimate)\nlibrary(stats)\nlibrary(plotly)\nlibrary(ggplot2)\nlibrary(tidyverse)\nlibrary(treemap)\nlibrary(treemapify)\nlibrary(magick)\nlibrary(data.table)\n\n# Cargar los datos del archivo CSV\ndatos <- read.csv(\"data.csv\")\n\ndatos <- mutate(datos, Goles = 1)\n```\n\n# Goles por cada club\n\nDruante los más de 20 años de carrera futbolística, Cristiano Ronaldo ha jugado en solamente 5 clubes. Destaca sobre todo su paso por el Real Madrid donde consiguió el mayor número de logros de su carrera destacando en especial los 4 Balones de Oro y las 4 Champions League conseguidas con el equipo madridista. De esta manera, analizaremos el total de goles anotados en cada club en el que estuvo aunque cabe destacar que no en todos los clubes ha estado el mismo tiempo ya que en el Real Madrid estuvo 9 temporadas mientras que en el Manchester United estuvo 7, 3 en la Juventus y un año solamente tanto en el Sporting de Portugal como en el Al Nassr.\n\n```{r}\ndf <- datos %>% select(Goles, Club)\n\ntotal_goles <- aggregate(Goles ~ Club, data = df, FUN = sum)\n\ngrafico <- ggplot(total_goles, aes(x = \"\", y = Goles, fill = Club)) +\n  geom_bar(stat = \"identity\", width = 1) +\n  geom_text(aes(label = Goles), position = position_stack(vjust = 0.5), color = \"black\") +\n  coord_polar(\"y\", start = 0) +\n  labs(title = \"Goles anotados por Cristiano Ronaldo en cada club\",\n       fill = \"Club\",\n       x = NULL,\n       y = NULL) +\n  theme_minimal() +\n  theme(legend.position = \"right\",\n        axis.text = element_blank(),\n        axis.title = element_blank(),\n        plot.title = element_text(hjust = 0.6))\n\ngrafico\n```\n\n# Goles por competición y club\n\nA continuación, analizaremos de una forma más general las goles anotados por Cristiano en cada competición para posteriormente concretar aún más estadísticas como en que club se han anotado esos goles. Cabe destacar que en el primer análisis, más general, se ha extraído de la tabla por motivos estéticos ciertas competiciones donde el jugador no ha tenido unas estadísiticas muy positivas debido al escaso número de goles. Estas competiciones son la Champions League Qualifying donde Cristiano solamente anotó 1 tanto seguido de la Europa League, la Taca de Portugal Placard y la UEFA Super Cup con 2 tantos, la Liga Portugal con 3 y, por último, la Supercopa, la EFL Cup y la Italy Cup con 4.\n\n```{r}\ngoles_compet <- datos %>% select(Goles, Competition)\n\n\ntotal_goles3 <- aggregate(Goles ~ Competition, data = goles_compet, FUN = sum)\n\ngoles_por_competicion <- total_goles3 %>%\n filter(!(Competition %in% c(\"Liga Portugal\", \"Taca de Portugal Placard\", \"UEFA Champions League Qualifying\", \n\"UEFA Super Cup\", \"Supercoppa Italiana\", \"Europa League\", \"Italy Cup\", \"Supercopa\", \"EFL Cup\"))) %>%\n ggplot() +\n aes(x = reorder(Competition, -Goles), y = Goles)+\n geom_col(fill = \"#112446\") +\n labs(x = \"Competición\", \n y = \"Goles\", title = \"Goles de Cristiano por competición\") +\n theme_minimal()+\n  theme(plot.title = element_text(hjust = 0.5))+\n          geom_text(aes(label = Goles), vjust=0.99,hjust=0.49, color=\"grey\",    \n            position = position_dodge(0.1),  size=4.0)\n    \ngoles_por_competicion\n```\n\n```{r}\nsetDT(datos)\n\n\ntabla2 <- datos[, .(Total_Goles = sum(Goles)), by = .(Competition, Club)]\n\n\ntabla2 %>% DT::datatable(extensions = 'Buttons',\n                                    options = list(dom = 'Blfrtip',\n                                                   buttons = c('copy','csv','excel', 'pdf', 'print'),\n                                                   pageLength = 5, autowidht = TRUE))\n```\n\n# Goles por temporada\n\nLa carrera de Ronaldo fue en aumento debido tanto a su madurez futbolísitca como a los compañeros que le rodeaban, reflejándose así en sus estadísticas goleadoras. De esta manera, en el siguiente gráfico observaremos como ha sido su evolución de manera positiva hasta que abandonó el Real Madrid. Posteriormente a este \"cambio de aires\" sus estadísitcas disminuyeron debido a diversos factores como la edad, el equipo, la posición o los minutos jugados. En cuanto al gráfico, cabe destacar que debido a un error en el fichero proporcionado por Kaggle, la temporada nombrada como \"Dec-13\" se refiere a la temporada 12/13 por lo que a pesar de situarse al final, debería situarse por el medio registrando así una de sus mejores temporadas jugando en el conjunto del Santiago Bernabeu\n\n```{r}\ngolesporaño <- datos %>% select(Goles, Season)\n\ngoles_totales_por_año <- aggregate(Goles ~ Season, data = golesporaño, FUN = sum)\n\ngrafico_goles_año <- ggplot(data = goles_totales_por_año) +\n  aes(x = Season, y = Goles) +\n  geom_col(fill = \"#112446\") +\n  labs(x = \"Temporada\", y = \"Goles\", title = \"Goles de Cristiano Ronaldo por temporada\") +\n  theme_minimal() +\n  theme(plot.title = element_text(hjust = 0.5)) +\n  geom_text(aes(label = Goles), vjust=0.99,hjust=0.49, color=\"white\",    \n            position = position_dodge(0.1),  size=4.0)\n\ngrafico_goles_año\n\n```\n\n\n# Goles como local y visitante\n\nPor lo que respecta a la comparación entre los goles anotados jugando como local y aquellos anotados como visitante, cabe destacar que la A(Away) quiere decir que jugó como visitante y la H(Home) quiere decir que jugó como local. De esta manera se puede apreciar que en prácticamente todos los equipos, exceptuando su etapa actual en el Al Nassr, consigue anotar un mayor número de goles en los partidos jugados como local por lo que concluimos con que jugar junto a su afición le ha servido de impulso en su carrera anotando un total de 404 goles de local mientras que de visitante marcó \"solamente\" 306. A pesar de ello, Cristiano es un futbolista que, como vemos en los datos, no le teme a jugar en el estadio rival y siempre deja huella en el estadio al que va.\n\nCabe destacar que el orden en el gráfico en el caso de que no pueda leerlo debido a los nombres largos de los Clubes es el Al Nassr, seguido de la Juventus, el Manchester United, el Real Madrid y por último, el Sporting de Portugal\n\n\n\n```{r}\nLocal_Visitante <- datos %>% select(Goles, Club, Venue)\n\ndatos_local_visitante <- Local_Visitante %>%\n  group_by(Club, Venue) %>%\n  summarise(Total_Goles = sum(Goles), .groups = \"drop\")\n\n\ngrafico3 <- ggplot(datos_local_visitante, aes(x = Club, y = Total_Goles, fill = Venue)) +\n  geom_bar(stat = \"identity\") +\n  facet_wrap(~ Venue) +\n  labs(title = \"Goles de Cristiano Ronaldo por Equipo y Local/Visitante\",\n       x = \"Club\",\n       y = \"Goles\") +\n  theme_minimal()+\n  geom_text(aes(label = Total_Goles), vjust=0.99,hjust=0.49, color=\"black\",    \n            position = position_dodge(0.1),  size=4.0)\n\ngrafico3\n```\n\n\n# Tipo de goles\n\nSi por algo se ha caracterizado Cristiano a lo largo de su carrera ha sido por no tener un único tipo de gol sino que sus goles han sido de diferentes formas, con diferentes partes del cuerpo o en diferentes situaciones del partido. A pesar de ello, puesto que el pie dominante del jugador es la derecha, situamos en primer lugar en el ranking los goles con su pierna derecha con un total de 253. Otro dato a destacar es que ROnaldo siempre ha sido etiquietado como uno de los mejores cabeceadores, dato el cual se ve reflejado en las estadísticas con un total de 112 goles de cabeza. Además, allá donde fuese, siempre era líder, capitán y el encargado de librar los libres directos y los penaltis de manera que un alto porcentaje, alrededor del 20%, han sido anotaciones desde los 11 metros.\n\nCabe destacar que el total de goles del gráfico solamente alcanza los 695 goles puesto que en el fichero de datos eran 15 los goles que no tenían un tipo de gol adjudicado.\n\n\n```{r}\ntipo_gol <- datos %>% select(Goles, Type)\n\ntipo_gol2 <- tipo_gol %>% filter(!is.na(Type) & Type != \"\")\n\ntipo_gol3 <- aggregate(Goles ~ Type, data = tipo_gol2, FUN = sum)\n\ngrafico_tipo_gol <- ggplot(tipo_gol3) +\n  aes(x = reorder(Type, +Goles), y = Goles) + geom_col(fill = \"#112446\") +\n  labs(\n    x = \"Tipo de gol\",\n    y = \"Goles\",\n    title = \"Tipo de gol\") + \n  theme(plot.title = element_text(hjust = 0.5))+\n  geom_text(aes(label= Goles), vjust=0.49,hjust=0.95, color= \"grey\",    \n            position = position_dodge(0.1),  size=4.6) + \n  coord_flip()\n\ngrafico_tipo_gol\n```\n\n\n\n# Rivales favoritos en su época en el Real Madrid\n\nA cualquier persona que le preguntes que se haga una imagen mental de Cristiano Ronaldo, será con la camiseta del Real Madrid puesto que fue ahí donde más años estuvo (9) y donde más logros alcanzó. Ahora nos centraremos en su época como jugador del conjunto blanco y analizaremos sus rivales favoritos, es decir, aquellos a quienes les marcó una mayor cantidad de tantos en todas las competiciones. Con este análisis se busca en parte resolver algunas críticas recibidas por el futbolista portugués que afirmaban que la gran cantidad de goles anotados en su carrera era debido a que \"se aprovechaba\" de los equipos pequeños para aumentar las estadísiticas y que, en cambio, contra los equipos grandes no hacía nada.\nDe esta manera, observamos que 4 de los 6 equipos que lideran el ranking se tratan de equipos grandes puesto que solamente el Getafe (23 goles) y el Celta (20 goles) no son considerados equipos existosos. Por tanto, de estos 4 equipos, su rival favorito es el Sevilla (27 goles) seguido del Atletico de Madird (22 goles), FC Barcelona (18 goles) y Athletic Club de Bilbao (17 goles).\n\n```{r}\nrivales <- subset(datos, Club == \"Real Madrid\" & Goles > 0)\n\nrivales_favoritos <-  rivales %>% select(Opponent, Goles)\n\nrivales_fav <- aggregate(Goles ~ Opponent, data = rivales_favoritos, FUN = sum)\n\nrivales_fav2 <- head(arrange(rivales_fav, desc(Goles)), 17)\n\ngrafico_rivales <- ggplot(rivales_fav2) + \n  aes(area = Goles,fill = Opponent, label = Opponent) +\n  geom_treemap() +\n  geom_treemap_text(colour = \"black\",\n                    place = \"centre\",\n                    size = 15) +\n  scale_fill_grey() +\n  labs(title = \"Rivales favoritos\",\n       subtitle = \"Como jugador del Real Madrid\")\n\ngrafico_rivales\n```\n\n\n# Conclusión\n\nPara finalizar con este análisis cuantitativo de la carrera de Cristiano Ronaldo, destacamos que estamos hablando del máximo goleador de la historia de un deporte como el fútbol lo que lo sitúa en uno de los mejores jugadores de la historia. Además, observamos su rápida madurez futbolísitca ya que en sus primeros años de carrera alcanzó a conseguir datos al alcance de muy pocos. Asímismo, observamos que tiene un impacto muy grande en cualquier club que vaya destacando sobre todo su paso por el Real Madrid. Para concluir, recalcamos que el futbolista, a sus 38 de edad, sigue registrando datos bastante impactantes y vemos como su registro goleador sigue en continuo aumento.\n\n\n# Bibliografía\n\nComo se ha mencionado en el apartado de los datos obtenidos, la principal fuente de información que hemos utilizado es:\n\n[Kaggle](https://www.kaggle.com) , y para obtener la fuente de datos: [Cristiano Ronaldo](https://www.kaggle.com/datasets/azminetoushikwasi/cr7-cristiano-ronaldo-all-club-goals-stats)\n\n"},"formats":{"html":{"execute":{"fig-width":7,"fig-height":5,"fig-format":"retina","fig-dpi":96,"df-print":"default","error":false,"eval":true,"cache":null,"freeze":false,"echo":true,"output":true,"warning":false,"include":true,"keep-md":false,"keep-ipynb":false,"ipynb":null,"enabled":null,"daemon":null,"daemon-restart":false,"debug":false,"ipynb-filters":[],"message":false,"engine":"knitr"},"render":{"keep-tex":false,"keep-source":false,"keep-hidden":false,"prefer-html":false,"output-divs":true,"output-ext":"html","fig-align":"default","fig-pos":null,"fig-env":null,"code-fold":"show","code-overflow":"wrap","code-link":true,"code-line-numbers":true,"code-tools":true,"tbl-colwidths":"auto","merge-includes":true,"latex-auto-mk":true,"latex-auto-install":true,"latex-clean":true,"latex-max-runs":10,"latex-makeindex":"makeindex","latex-makeindex-opts":[],"latex-tlmgr-opts":[],"latex-input-paths":[],"latex-output-dir":null,"link-external-icon":false,"link-external-newwindow":true,"self-contained-math":false,"format-resources":[]},"pandoc":{"standalone":true,"wrap":"none","default-image-extension":"png","to":"html","highlight-style":"a11y","css":["styles.css"],"toc":true,"toc-depth":3,"output-file":"blog.html"},"language":{},"metadata":{"lang":"es","fig-responsive":true,"quarto-version":"1.2.313","license":"CC BY","knitr":{"opts_chunk":{"collapse":true,"comment":"#>","fig.asp":"7/9","out.width":"95%","fig.align":"center","fig.show":"hold","R.options":"options(scipen = 999)"}},"theme":"united","page-layout":"full","code-copy":true,"title":"La carrera de Cristiano Ronaldo","description":"En este trabajo analizaremos la carrera de Cristiano Ronaldo, para algunos, el mejor de la historia, en base a datos y estadisiticas conseguidas a lo largo de su carrera.\n","author":[{"name":"José Mª Pérez Marco (jomape4@alumni.uv.es)"}],"date":"2023-05-30","categories":["trabajo Big Data"],"image":"./imagenes/profile.jpg","title-block-banner":true,"title-block-banner-color":"white","toc-location":"left","smooth-scroll":true,"mainfont":"serif"},"extensions":{"book":{"multiFile":true}}}}}